Repository: csanahuja/collective.pwexpiry
Catalog: collective/pwexpiry/locales/*/LC_MESSAGES/collective.pwexpiry.po
Languages: ca

source: Add a browserlayer
ca: Afegeix una browserlayer

source: Adds the feature of password expiration control.
ca: Afegeix la funcionalitat del control de l'expiració de la contrasenya

source: Include the new whitelisted_users in the registry
ca: Incloure els nous usuaris de la llista blanca al registre

source: Never
ca: Mai

source: No users were unlocked
ca: Cap usuari bloquejat

source: Password expiration
ca: Expiració de la contrasenya

source: Passwords must be at least 8 characters in length.
ca: Mínim 8 caràcters

source: Passwords must contain at least three of the following four character groups: Uppercase characters (A through Z), Lowercase characters (a through z), Numerals (0 through 9), Special characters such as !, $, #, %
ca: Ha de contenir tres de les 4 característiques: Majúscules (A-Z), minúscules (a-z), nombres (0-9), caràcters especials com !, $, #, %

source: Show status message 'your account has expired' in login popup.
ca: Mostrar el missatge d'estat 'el seu compte ha expirat' al pop-up del login

source: The following users were unlocked: %s,
ca: Els següents usuaris han estat desbloquejats: %s

source: User's password expiration panel
ca: Panell d'expiració de la contrasenya de l'usuari

source: You have to change your password.
ca: Ha de canviar la seva contrasenya

source: Your account has been locked due to too many invalid attempts to login with a wrong password. Your account will remain blocked for the next ${hrs} hours. You can reset your password, or contact an administrator to unlock it, using the Contact form.
ca: El vostre compte ha estat bloquejat degut a massa intents de login amb una contrasenya incorrecta. El vostre compte romandrà bloquejat les properes ${hrs} hores. Podeu reiniciar la contrasenya, o contactar un administrador per desbloquejar-lo.

source: Your password cannot contain your account name(Username), first name or last name.
ca: La contrasenya no pot contenir el nom d'usuari, o el nom complet

source: Your password has expired.
ca: La contrasenya ha expirat

source: change_password_email_text
ca: Per tal de canviar la contrasenya, si us plau visiteu ${server_url}/@@change-password

source: description_pas_show_all_search_results
ca: Mostrar tots els resultats de la cerca

source: description_password_expiration
ca: Veure i administrar les propietats de l'expiració de les contrasenyes

source: email_subject
ca: ${days} dies restants fins que la vostra contrasenya expiri

source: email_text
ca: Benvolgut ${fullname}, Resten ${days} dies abans que la vostra contrasenya expiri! Si us plau canvieu-la abans de la data d'expiració.

source: email_text_expired
ca: Benvolgut ${fullname}, La seva contrasenya ha expirat. Si us plau canvieu-la.

source: info_reused_pw
ca: Aquesta contrasenya ja s'ha utilitzat prèviament

source: label_apply_changes
ca: Aplicar canvis

source: label_save_whitelist
ca: Guardar llista blanca

source: label_whitelist_users
ca: Usuaris de la llista blanca

source: reset_password_email_text
ca: Per tal de canviar la seva contrasenya, si us plau visiteu ${server_url}/mail_password_form?userid=${username}

source: server_name_email_text
ca: Aquest correu ha estat enviat des de ${server_name}
